Documents/НеподтвержденныеПлатежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НеподтвержденныеПлатежи</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДатыИСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НеподтвержденныеПлатежи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектОбъект);
	
	Объект.Объект = Параметры.ВходящийОбъект;
	
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
	//	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатыИСуммыСуммаВВалютеПриИзменении(Элемент)
	Если Элементы.ДатыИСуммы.ТекущиеДанные <> Неопределено И 
			Не Элементы.ДатыИСуммы.ТекущиеДанные.Валюта.Пустая() И
			ЗначениеЗаполнено(Элементы.ДатыИСуммы.ТекущиеДанные.Дата) Тогда
		////Элементы.ДатыИСуммы.ТекущиеДанные.СуммаРегл = ПересчитатьСуммуВВалютуРегл(
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Дата, Элементы.ДатыИСуммы.ТекущиеДанные.СуммаВВалюте,
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатыИСуммыВалютаПриИзменении(Элемент)
	Если Элементы.ДатыИСуммы.ТекущиеДанные <> Неопределено И 
			Не Элементы.ДатыИСуммы.ТекущиеДанные.Валюта.Пустая() И
			ЗначениеЗаполнено(Элементы.ДатыИСуммы.ТекущиеДанные.Дата) Тогда
		////Элементы.ДатыИСуммы.ТекущиеДанные.СуммаРегл = ПересчитатьСуммуВВалютуРегл(
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Дата, Элементы.ДатыИСуммы.ТекущиеДанные.СуммаВВалюте,
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатыИСуммыДатаПриИзменении(Элемент)
	Если Элементы.ДатыИСуммы.ТекущиеДанные <> Неопределено И 
			Не Элементы.ДатыИСуммы.ТекущиеДанные.Валюта.Пустая() И
			ЗначениеЗаполнено(Элементы.ДатыИСуммы.ТекущиеДанные.Дата) Тогда
		////Элементы.ДатыИСуммы.ТекущиеДанные.СуммаРегл = ПересчитатьСуммуВВалютуРегл(
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Дата, Элементы.ДатыИСуммы.ТекущиеДанные.СуммаВВалюте,
		////		Элементы.ДатыИСуммы.ТекущиеДанные.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПересчитатьСуммуВВалютуРегл(ДатаПлатежа, СуммаПлатежа, ВалютаПлатежа)
	ТаблицаВВалюте = РегистрыСведений.КурсыВалют.СрезПоследних(ДатаПлатежа, Новый Структура("Валюта", 
			ВалютаПлатежа));	
	Если ТаблицаВВалюте.Количество() > 0 Тогда
		Возврат СуммаПлатежа * ТаблицаВВалюте[0].Курс * ТаблицаВВалюте[0].Кратность;
	Иначе
		Возврат Неопределено;
	КонецЕсли;				
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПараметрыСохранения = Новый Структура;
	ПараметрыСохранения.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыСохранения.Вставить("Владелец", ВладелецФормы);
	Оповестить("СохранениеДокумент", ПараметрыСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьОбъектПоМероприятию" Тогда
	
		Объект.Объект = Параметр["ВходящийОбъект"];
	
	КонецЕсли;
КонецПроцедуры
